
from openai import OpenAI
#total_moneys = [10, 13, 21, 22, 25, 41, 39, 31, 29, 27]
port = 8001
count_num = 15
#total_moneys = [10, 10, 10, 10, 10, 10, 10, 10, 10, 10]
total_moneys = [10,10]
#total_moneys = [30, 30, 30, 30, 30, 30, 30, 30, 30, 30]

use_plan =True

api_key_tongyi="sk-7394f6c37d9b400db23ce8bb7e97e336"
output_type = 2 # 1是无分析,其它随便哪个数都是有分析
length_of_decision = 10
model = "qwen3-max" # 最强版 
#model = "qwen-plus" # 稍微差一点
summarize_num_intercepted = 1 # 触发内部拦截规律总结的数量要求
summarize_num_arrested = 1 # 触发外部逮捕时间规律总结的数量要求

judger_output_with_explain = True # 陪审团是否输出原因

client = OpenAI(
    # 新加坡和北京地域的API Key不同。获取API Key：https://help.aliyun.com/zh/model-studio/get-api-key
    api_key=api_key_tongyi,
    # 以下是北京地域base_url,如果使用新加坡地域的模型,需要将base_url替换为：https://dashscope-intl.aliyuncs.com/compatible-mode/v1
    base_url="https://dashscope.aliyuncs.com/compatible-mode/v1",
)


# 待办：实验框架撰写，改为英文。
illegal_transfer_sequences = [[23, 17, 12, 17, 16, 16, 12, 12, 25, 25, 17, 3, 0, 4, 16, 22, 4, 21, 11, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 21, 7, 1, 22, 3, 25, 15, 8, 20, 1, 12, 18, 9, 9, 19, 20, 15, 8, 4, 21, 9, 7, 4, 14, 0, 11, 21, 25, 24, 0, 6, 8, 15, 17, 22, 22, 23, 9, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 5, 22, 13, 22, 24, 23, 16, 2, 21, 9, 21, 17, 24, 11, 19, 10, 0, 18, 2, 25, 22, 20, 12, 20, 8, 12, 18, 9, 4, 6, 15, 17, 13, 18, 8, 23, 17, 4, 21, 20, 4, 5, 10, 12, 8, 11, 3, 3, 20, 13, 25, 0, 20, 0, 25, 3, 11, 10, 14],[2, 2, 1, 2, 2, 3, 0, 0, 3, 2, 0, 3, 1, 1, 1, 2, 1, 1, 2, 2, 2, 2, 2, 1, 2, 1, 1, 3, 2, 2, 3, 1, 3, 0, 1, 2, 0, 2, 3, 2, 2, 2, 2, 1, 2, 1, 2, 1, 1, 2, 0, 3, 2, 1, 1, 2, 3, 2, 2, 2, 3, 2, 1, 1, 3, 1, 1, 3, 1, 2, 1, 3, 3, 1, 3, 2, 2, 3, 0, 2, 0, 1, 3, 2, 3, 1, 2, 3, 0, 2]]
legal_transfer_sequences = [[0, 11, 0, 17, 20, 0, 12, 0, 0, 0, 0, 8, 10, 0, 0, 0, 0, 0, 18, 0, 0, 0, 8, 0, 0, 0, 0, 4, 0, 0, 2, 0, 0, 0, 0, 12, 0, 0, 0, 0, 0, 0, 0, 20, 1, 13, 8, 0, 7, 0, 3, 20, 8, 0, 0, 0, 0, 6, 0, 2, 0, 0, 13, 4, 2, 0, 0, 10, 7, 0, 0, 0, 0, 1, 1, 0, 20, 0, 19, 12, 0, 16, 0, 12, 0, 14, 0, 13, 19, 0],[0, 10, 0, 10, 0, 4, 0, 0, 0, 4, 0, 0, 0, 0, 0, 9, 0, 0, 0, 0, 0, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 0, 0, 0, 0, 0, 0, 0, 0, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 0, 0, 0, 0, 0, 0, 6, 1, 0, 3, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0]]